tutorials/pM4F-Benchmarks/case6/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel  Newtonian;
mu              mu [ 1 -1 -1 0 0 0 0 ] 1e-3;
rho              rho [ 1 -3 0 0 0 0 0 ] 1000;

geochemicalProperties
{
rhol              rhol [ 1 -3 0 0 0 0 0 ] 1000;

 geochemicalModel phreeqcRM;

 mineral (Calcite Gypsum Ferrihydrite Jarosite Gibbsite Siderite);

 absolutePermeabilityModel KozenyCarman;
 KozenyCarmanCoeffs
 {
	K0 K0 [0 2 0 0 0 0 0] 1.18602e-11;
 }

 dispersionModel archiesLaw;
 archiesLawCoeffs
 {
        Di              Di  [0 2 -1 0 0 0 0] 1e-9;
        alphaL   alphaL [0 1 0 0 0 0 0] 0;
	n 0.33;
 }

 CalciteProperties
 {
	activatePhaseEquilibrium false;
	rhos rhos [1 -3 0 0 0 0 0] 2707.;
	Vm Vm [0 3 0 0 -1 0 0] 36.93336e-6;
	surfaceAreaModel mingliangLaw;
	mingliangLawCoeffs
	{
	 A0 A0 [0 -1 0 0 0 0 0] .1;
	 n 0.667;
	 initVF 0.22;
	}
 }

 GypsumProperties
 {
        activatePhaseEquilibrium false;
        rhos rhos [1 -3 0 0 0 0 0] 2320.;
        Vm Vm [0 3 0 0 -1 0 0] 74.21216e-6;
        surfaceAreaModel mingliangLaw;
        mingliangLawCoeffs
        {
         A0 A0 [0 -1 0 0 0 0 0] .1;
         n 1.;
	 initVF 0.;
        }
 }

 FerrihydriteProperties
 {
        activatePhaseEquilibrium false;
        rhos rhos [1 -3 0 0 0 0 0] 4370.;
        Vm Vm [0 3 0 0 -1 0 0] 23.99e-6;
        surfaceAreaModel mingliangLaw;
        mingliangLawCoeffs
        {
         A0 A0 [0 -1 0 0 0 0 0] .1;
         n 1.;
	 initVF 0.;
        }
 }

 JarositeProperties
 {
        activatePhaseEquilibrium false;
        rhos rhos [1 -3 0 0 0 0 0] 3200.;
        Vm Vm [0 3 0 0 -1 0 0] 154.63e-6;
        surfaceAreaModel mingliangLaw;
        mingliangLawCoeffs
        {
         A0 A0 [0 -1 0 0 0 0 0] .1;
         n 1.;
	 initVF 0.;
        }
 }

 GibbsiteProperties
 {
        activatePhaseEquilibrium false;
        rhos rhos [1 -3 0 0 0 0 0] 2350.;
        Vm Vm [0 3 0 0 -1 0 0] 33.19e-6;
        surfaceAreaModel mingliangLaw;
        mingliangLawCoeffs
        {
         A0 A0 [0 -1 0 0 0 0 0] .1;
         n 0.667;
	 initVF 0.05;
        }
 }

 SideriteProperties
 {
        activatePhaseEquilibrium false;
        rhos rhos [1 -3 0 0 0 0 0] 3960.;
        Vm Vm [0 3 0 0 -1 0 0] 29.26e-6;
        surfaceAreaModel mingliangLaw;
        mingliangLawCoeffs
        {
         A0 A0 [0 -1 0 0 0 0 0] .1;
         n 0.667;
	 initVF 0.05;
        }
 }

phreeqcRM
{
        PhreeqcInputFile "phreeqcInputChristophe"; 
        PhreeqcDataBase  "dbs";

        activateUpdatePorosity true;

	use_cvODE true;
	numThreads 2;
}

}

// ************************************************************************* //
